config.org
#+TITLE: config
#+STARTUP: fold

* general config
** localleader

#+BEGIN_SRC emacs-lisp
(setq doom-localleader-key ",")
#+END_SRC

# Stop complaining about non-prefix keys

# #+BEGIN_SRC emacs-lisp
# (general-auto-unbind-keys)
# #+END_SRC

** ui
*** theme

#+BEGIN_SRC emacs-lisp
(setq doom-theme 'doom-opera-light)
#+END_SRC

*** hl-line

Highlighting the current line is all nice and stuff but it looks off in org mode due to different sizes of headings.
Similarly in LaTeX due to sub/super -scripts.

#+BEGIN_SRC emacs-lisp
(remove-hook 'text-mode-hook #'hl-line-mode)
#+END_SRC

*** font

#+BEGIN_SRC emacs-lisp
;;(setq doom-font (font-spec :family "Terminus" :size 14))
;; (setq doom-font (font-spec :family "FiraCode-Regular" :size 24)
#+END_SRC

*** paren-mode
Highlight matching parentheses and such in every mode.

#+BEGIN_SRC emacs-lisp
(show-paren-mode 1)
#+END_SRC

*** line number

Show line numbers to the left for better jumping.
(consider the ace jump package which shows a letter for every line for more efficient jumping)

#+BEGIN_SRC emacs-lisp
;; (setq display-line-numbers-type 'relative)
(setq display-line-numbers-type nil)
#+END_SRC

*** line truncation

stupid doom tries to truncate lines all the time which I don't like. This means that long lines go past the window end. When this is turned off they appear soft wrapped.

#+BEGIN_SRC emacs-lisp
(setq-default truncate-lines nil)
#+END_SRC

I have still no idea how this relates to ~visual-line-mode~. Seems to do the same...

*** opacity

Make emacs opaque (when running compton).

#+BEGIN_SRC emacs-lisp
;; (set-frame-parameter (selected-frame) 'alpha '(85 . 85))
;; (add-to-list 'default-frame-alist '(alpha . (85 . 85)))
#+END_SRC

*** modeline

#+BEGIN_SRC emacs-lisp
(after! doom-modeline
  ;; Disable unwanted modeline details.
  (size-indication-mode 0)

  ;; ;; Define a new default modeline.
  ;; (doom-modeline-def-modeline 'myline
  ;;   '(bar workspace-name window-number buffer-info remote-host)
  ;;   '(matches debug checker))

  ;; ;; Actually use the new settings.
  ;; (add-hook 'doom-modeline-mode-hook
  ;;   (lambda ()
  ;;     (doom-modeline-set-modeline 'myline 'default)))
  )
#+END_SRC
*** hl-todo

highlight keywords like TODO/FIXME/NOTE/DEPRECATED/HACK/REVIEW.

#+BEGIN_SRC emacs-lisp
(add-hook 'after-init-hook 'global-hl-todo-mode)
#+END_SRC

** general behavior

When splitting windows, put split on a reasonable side.

#+BEGIN_SRC emacs-lisp
(setq evil-split-window-below t
      evil-vsplit-window-right t)
#+END_SRC

I don't want aut-fill on by DEFAULT

#+BEGIN_SRC emacs-lisp
(remove-hook 'text-mode-hook #'auto-fill-mode)
#+END_SRC

When moving up or down. Start moving the text before the curser hits the border of the screen. Equivalent to vims ~scroll-off~.

#+BEGIN_SRC emacs-lisp
(setq scroll-margin 5)
#+END_SRC

** email

currently still using mutt. This tells Emacs to use mail mode when editing emails through mutt.

#+BEGIN_SRC emacs-lisp
(add-to-list 'auto-mode-alist '("/mutt" . mail-mode))
(add-to-list 'auto-mode-alist '("/neomutt" . mail-mode))
#+END_SRC

Turn on auto fill and break after specified number of chars

#+BEGIN_SRC emacs-lisp
(add-hook 'mail-mode-hook #'auto-fill-mode)
(add-hook 'mail-mode-hook
          (lambda ()
            (set-fill-column 72)))
#+END_SRC

This is copied from [[https://github.com/NicolasPetton/emacs.d/blob/3945786c31a17ac9caa8894109c231234956102f/hosts/blueberry/init-notmuch.el][github]] who took it from [[http://blog.binchen.org/posts/how-to-use-yasnippets-to-produce-email-templates-in-emacs.html][this blog]].

#+BEGIN_SRC emacs-lisp
;; Function to return first name of email recipient
;; Used by yasnippet
#+END_SRC

** dashboard

Show agenda for upcoming week and not just today.

#+BEGIN_SRC emacs-lisp
(setq show-week-agenda-p t)
#+END_SRC

** GTD

Keep everything out of your head, aka building a second brain.

#+BEGIN_SRC emacs-lisp
(defun ab/visit-references ()
  "go to my references file"
  (interactive)
  (find-file "~/org/Reference.org"))
#+END_SRC

** general nifty mappings

Most of the time I only have two windows open. Switching between should be easy.

#+BEGIN_SRC emacs-lisp
(map! "M-w" 'other-window)
#+END_SRC

~counsel-find-file~ lets you open a file in a new split, but with a weird mapping ~C-o j~.
I want a better one. However. this currently only works for ~find-file~ and not ~find-buffer~.


#+BEGIN_SRC emacs-lisp
(defun ivy-ffow-done ()
  "Exit the minibuffer, opening candidate in other window."
  (interactive)
  (ivy-set-action #'find-file-other-window)
  (ivy-done))

(map! :after counsel
      :map counsel-find-file-map
      "M-RET" #'ivy-ffow-done)
#+END_SRC
** recent files

When I kill emacs it doesn't remember which files I visited.
This makes MRU files rather useless. So let's save them regularly while running.
#+BEGIN_SRC emacs-lisp
(run-at-time (current-time) 300 'recentf-save-list)
#+END_SRC


* config file
** quick access

Configuring never stops. keep the config file close.

#+BEGIN_SRC emacs-lisp
(defun ab/visit-emacs-config ()
  "go to emacs config file"
  (interactive)
  (find-file "~/.doom.d/config.org"))

(map! :leader "e c" #'ab/visit-emacs-config)

(defun ab/visit-init ()
  "go to doom init file"
  (interactive)
  (find-file "~/.doom.d/init.el"))

(map! :leader "e i" #'ab/visit-init)
#+END_SRC

** reload
When regularly changing configs we also want to be able to use them without restarting emacs.

#+BEGIN_SRC emacs-lisp
(defun ab/reload-init-file ()
  "reload config file"
  (interactive)
  (load-file "~/.doom.d/config.el"))

(map! :leader "e r" 'ab/reload-init-file)
#+END_SRC

* vi
** config

Not quite sure what this does but it seems to fix some weird behavior with
visual lines

#+BEGIN_SRC emacs-lisp
(setq evil-respect-visual-line-mode nil)
#+END_SRC

If I don't set this, long lines are just cut off and the remainder is not displayed. Makes it impossible to edit such lines.

** leader

More vim functionality.

Set the leader key and some very basic keybindings.

#+BEGIN_SRC emacs-lisp
(map! :leader
      "q"   #'evil-quit
      "s h" #'evil-window-split
      "s v" #'evil-window-vsplit
      "e c" #'ab/visit-emacs-config
      "r"   #'ab/visit-references
      "x"   #'counsel-M-x ;; no need to press *meta*
      "w"   #'save-buffer)
#+END_SRC

** colemak settings :colemak:

*** new

Only this way I can use "N" in elfeed for example
#+BEGIN_SRC emacs-lisp
(after! evil
  (define-key evil-visual-state-map "l" evil-inner-text-objects-map)
  (define-key evil-operator-state-map "l" evil-inner-text-objects-map)
  (map! :n "l" 'evil-insert
        :n "L" 'evil-insert-line
        :nv "h" 'evil-backward-char
        :nv "i" 'evil-forward-char
        :nv "n" 'evil-next-visual-line
        :nv "e" 'evil-previous-visual-line
        :nv "k" 'evil-ex-search-next
        :nv "K" 'evil-ex-search-previous
        :n "N" 'evil-join
        ;; :vo "l" evil-inner-text-objects-map
        :nvo "j" 'evil-forward-word-end
        :nvo "J" 'evil-forward-WORD-end))

(after! magit
  (map! :map magit-mode-map
        :n "n" 'magit-next-line
        :n "e" 'magit-previous-line))

(map! :map org-agenda-mode-map
      :m "n" 'org-agenda-next-line
      :m "e" 'org-agenda-previous-line
      )
#+END_SRC

This is an adaptation of [[https://github.com/doomemacs/doomemacs/issues/783][this issue]].

*** old

This does not allow me to remap for example "N" in elfeed-show-mode

Evil for colemak keyboard layout. Adapted from the [[https://github.com/wbolster/evil-colemak-basics][evil-colemak-basics]] package. For some reason trying to defining everything manually via ~evil-define-key~ or ~define-key evil-motion-state-map~ gave me trouble with ~'inner-text-objects~ and more..

#+BEGIN_SRC emacs-lisp
;; (defgroup evil-colemak nil
;;   "Basic key rebindings for evil-mode with the Colemak keyboard layout."
;;   :prefix "evil-colemak-"
;;   :group 'evil)

;; (defcustom evil-colemak-char-jump-commands nil
;;   "The set of commands to use for jumping to characters.
;;         By default, the built-in evil commands evil-find-char (and
;;         variations) are used"
;;   :group 'evil-colemak
;;   :type '(choice (const :tag "default" nil)))

;; (defun evil-colemak--make-keymap ()
;;   "Initialise the keymap baset on the current configuration."
;;   (let ((keymap (make-sparse-keymap)))
;;     (evil-define-key '(motion normal visual) keymap
;;       "n" 'evil-next-visual-line
;;       ;; "gn" 'evil-next-visual-line
;;       ;; "gN" 'evil-next-visual-line
;;       "e" 'evil-previous-visual-line
;;       ;; "ge" 'evil-previous-visual-line
;;       "E" 'evil-lookup
;;       "i" 'evil-forward-char
;;       "I" 'evil-end-of-line
;;       "j" 'evil-forward-word-end
;;       "J" 'evil-forward-WORD-end
;;       "gj" 'evil-backward-word-end
;;       "gJ" 'evil-backward-WORD-end
;;       "k" 'evil-ex-search-next       ;; doom needs an "ex"
;;       "K" 'evil-ex-search-previous   ;; doom needs an "ex"
;;       "gk" 'evil-next-match
;;       "gK" 'evil-previous-match
;;       "zi" 'evil-scroll-column-right
;;       "zI" 'evil-scroll-right)
;;     (evil-define-key '(normal visual) keymap
;;       "N" 'evil-join
;;       "gN" 'evil-join-whitespace)
;;     (evil-define-key 'normal keymap
;;       "l" 'evil-insert
;;       "L" 'evil-insert-line)
;;     (evil-define-key 'visual keymap
;;       "L" 'evil-insert)
;;     (evil-define-key '(visual operator) keymap
;;       "l" evil-inner-text-objects-map)
;;     (evil-define-key 'operator keymap
;;       "i" 'evil-forward-char)
;;     keymap))

;; (defvar evil-colemak-keymap
;;   (evil-colemak--make-keymap)
;;   "Keymap for evil-colemak-mode.")

;; (defun evil-colemak-refresh-keymap ()
;;   "Refresh the keymap using the current configuration."
;;   (setq evil-colemak-keymap (evil-colemak--make-keymap)))

;;       ;;;###autoload
;; (define-minor-mode evil-colemak-mode
;;   "Minor mode with evil-mode enhancements for the Colemak keyboard layout."
;;   :keymap evil-colemak-keymap
;;   :lighter " hnei")

;;       ;;;###autoload
;; (define-globalized-minor-mode global-evil-colemak-mode
;;   evil-colemak-mode
;;   (lambda () (evil-colemak-mode t))
;;   "Global minor mode with evil-mode enhancements for the Colemak keyboard layout.")

;; (after! evil
;;   (global-evil-colemak-mode))
#+END_SRC
*** windows

Switching windows also relies on the `hjkl` motions. So make it colemak friendly.

#+BEGIN_SRC emacs-lisp
(with-eval-after-load 'evil-maps
  (define-key evil-window-map "n" 'evil-window-down)
  (define-key evil-window-map "e" 'evil-window-up)
  (define-key evil-window-map "i" 'evil-window-right))
#+END_SRC

