config.org
*** org-mode

~evil-org-mode~ overrides some of my colemak settings. Override them again afterwards.

#+BEGIN_SRC emacs-lisp
(after! evil
  (map! :map evil-org-mode-map
        :mnvo "i" #'evil-forward-char
        :mnvo "I" #'evil-end-of-line))

(after! evil-org
  (map! :map evil-org-mode-map
        :mnvo "i" #'evil-forward-char
        :mnvo "I" #'evil-org-end-of-line))

;; (after! evil
;;   (map! :map evil-tex-mode-map
;;         :mnvo "i" #'evil-forward-char
;;         :mnvo "I" #'evil-org-end-of-line))
;; (add-hook 'evil-tex-mode-hook (lambda () (global-evil-colemak-mode)))
;; (add-hook 'LaTeX-mode-hook (lambda () (global-evil-colemak-mode)))
#+END_SRC

#+BEGIN_SRC emacs-lisp
;; (evil-collection-translate-key nil 'evil-motion-state-map
;;   ;; colemak hnei is qwerty hjkl
;;   "n" "j"
;;   "e" "k"
;;   "i" "l"
;;   ;; add back nei
;;   "j" "e"
;;   "k" "n"
;;   "l" "i")
;; (defun my-hjkl-rotation (_mode mode-keymaps &rest _rest)
;;   (evil-collection-translate-key 'normal mode-keymaps
;;     "n" "j"
;;     "e" "k"
;;     "i" "l"
;;     "j" "e"
;;     "k" "n"
;;     "l" "i"))

;; ;; called after evil-collection makes its keybindings
;; (add-hook 'evil-collection-setup-hook #'my-hjkl-rotation)

;; (evil-collection-init)
#+END_SRC
Different setup



** ~matchit~

Extend the ~%~ functionality to jump between tags such as LaTeX ~\begin{...}~ and ~\end{...}~. This is sooo important!!!

#+BEGIN_SRC emacs-lisp
(after! evil
  (global-evil-matchit-mode))
#+END_SRC

** paragraph

The function ~evil-forward-paragraph~ (default bound to ~}~) reuses Emacs'
~forward-paragraph~ which is different in every major mode. I've gotten used to
vim's behaviour of just going to the next empty line. This chunk makes evil use
the default paragraph. This makes so much more sense considering commands like
~y a p~ (read "yank around paragraph") treats paragraphs always the way I
want them. Got this from [[https://emacs.stackexchange.com/questions/38596/make-evil-paragraphs-behave-like-vim-paragraphs][here]].

#+BEGIN_SRC emacs-lisp
(with-eval-after-load 'evil
  (defadvice forward-evil-paragraph (around default-values activate)
    (let ((paragraph-start (default-value 'paragraph-start))
          (paragraph-separate (default-value 'paragraph-separate)))
      ad-do-it)))
#+END_SRC
** custom :colemak:

Custom mappings.

#+BEGIN_SRC emacs-lisp
(after! evil
  (map! :mnv "H" #'evil-first-non-blank
        :mnv "I" #'evil-end-of-line
        :mnv "E" #'+lookup/definition
        :leader "l" 'avy-goto-line))

(after! evil-org
  (map! :mnv "H" #'evil-first-non-blank
        :mnv "I" #'evil-end-of-line
        :mnv "E" #'+lookup/definition
        :leader "l" 'avy-goto-line))

(after! evil-snipe
  (map! :leader "/" #'evil-avy-goto-char-2))
#+END_SRC

* buffer handling

Switch back and forth between the two MRU buffers.

#+BEGIN_SRC emacs-lisp
(defun ab/switch-to-previous-buffer ()
  (interactive)
  (switch-to-buffer (other-buffer (current-buffer) 1)))

(map! :leader "SPC" #'ab/switch-to-previous-buffer)
#+END_SRC

* org mode

#+begin_center
=Your life in plain text=
#+end_center

** config

Load org-mode plus some standard keybindings.

#+BEGIN_SRC emacs-lisp
(after! org
  (setq +org-roam-auto-backlinks-buffer t
        org-hide-emphasis-markers nil            ;; I want those
        org-return-follows-link t
        ;; the follow two do not work for some reason and others seem to have the same problem
        org-agenda-skip-scheduled-if-done t      ;; don't show in agenda if done
        org-agenda-skip-deadline-if-done  t
        ;;
        org-agenda-compact-blocks t
        org-reverse-note-order t                 ;; add new headings on top
        org-tags-column 0                        ;; position of tags (0 is to the left)
        org-log-done 'time                       ;; add time when task was completed
        org-todo-keywords '((sequence "TODO(t)"
                                      "NEXT(n)"
                                      "WAITING(w)"
                                      "|"
                                      "DONE(d)")
                            ;; research specific
                            (sequence "TODO(t)"
                                      "DIDN'T SUCCEED(s)"
                                      "|"
                                      "DOESN'T WORK(x)"
                                      "TOO HARD(h)"
                                      "DONE(d)"))

        org-todo-keyword-faces '(("WAITING" :foreground "#8FBCBB" :weight bold)
                                 ("NEXT" :foreground "#ff9800" :weight bold)
                                 )))

(map! :leader
      "o s l" 'org-store-link
      "o s n" 'default/org-notes-search
      ;; "o a" 'org-agenda
      "o c" 'org-capture)
#+END_SRC

There is also ~org-agenda-skip-function-global '(org-agenda-skip-entry-if 'todo 'done)~ but I don't this so I cannot see done task of the day.

Line numbers in org mode are useless.

#+BEGIN_SRC emacs-lisp
(defun ab/disable-line-numbers ()
  (interactive)
  (display-line-numbers-mode -1))

(add-hook 'org-mode-hook #'ab/disable-line-numbers)
#+END_SRC

No instant spell checking.. Takes too long.
#+BEGIN_SRC emacs-lisp
(after! org
  (setq-hook! 'org-mode-hook +flyspell-immediately nil))
#+END_SRC

I have some reoccurring tasks/chores. These will be shown in the agenda multiple times. This is supposed to show them only once.
#+BEGIN_SRC emacs-lisp
(setq org-agenda-show-future-repeats 'next)
#+END_SRC

** agenda
Create a custom view.

I want a go-to GTD style agenda view with:
- scheduled tasks for the day
- deadlines
- what to work on next
- checking if the inbox is empty

This setup is from here: https://www.labri.fr/perso/nrougier/GTD/index.html#org67cf0bc

#+BEGIN_SRC emacs-lisp
(setq org-agenda-format-date
          (lambda (date)
            (concat "  " (org-agenda-format-date-aligned date))))

(setq org-agenda-custom-commands
      '(("W" "Weekly Review"
         ((agenda "" ((org-agenda-span 14))); review upcoming deadlines and appointments
                                           ; type "l" in the agenda to review logged items
          (todo "PROJECT") ; review all projects (assuming you use todo keywords to designate projects)
          (todo "MAYBE") ; review someday/maybe items
          (todo "WAITING"))) ; review waiting items

         ;; ...other commands here
        ("n" todo "NEXT")

        ("g" "Get Things Done (GTD)"
         ((todo "LALA" ;; dummy item just so I can get a header for the deadlines (see next item)
                ((org-agenda-overriding-header "\nScheduled\n")))
          (agenda ""
                  ((org-agenda-skip-function
                    '(org-agenda-skip-entry-if 'deadline 'done))   ;; deadlines go in a different "section"
                   (org-agenda-show-all-dates nil)
                   (org-agenda-prefix-format "    [%e]  ")
                   (org-agenda-overriding-header "\nScheduled\n")  ;; not working
                   (org-deadline-warning-days 0)))
          ;; (todo "LALA"
          ;;       ((org-agenda-overriding-header "\nUpcoming\n")))
          ;; (agenda ""
          ;;         (
          ;;          ;; (org-agenda-span 1)
          ;;          (org-agenda-skip-function
          ;;           '(org-agenda-skip-entry-if 'deadline))
          ;;          (org-agenda-show-all-dates nil)
          ;;          (org-agenda-overriding-header "\nScheduled\n")  ;; not working
          ;;          (org-deadline-warning-days 0)))
          (todo "NEXT"
                ((org-agenda-skip-function
                  '(org-agenda-skip-entry-if 'deadline))
                 (org-agenda-prefix-format "  %i %-12:c [%e] %s ")
                 (org-agenda-overriding-header "\nNext Action\n")))

          (todo "LALA" ;; dummy item just so I can get a header for the deadlines (see next item)
                ((org-agenda-overriding-header "\nDeadlines\n")))
          (agenda ""
                  ((org-agenda-entry-types '(:deadline))
                   (org-agenda-show-all-dates nil)
                   (org-agenda-prefix-format " %i [%e] %s ")
                   (org-agenda-overriding-header "\nDeadlines\n")  ;; not working
                   (org-deadline-warning-days 0)))
          (tags "inbox"
                     ((org-agenda-prefix-format "  [%e]  ")
                      (org-agenda-overriding-header "\nInbox\n")))
          (tags "CLOSED>=\"<today>\""
                ((org-agenda-overriding-header "\nCompleted today\n")))))

        ))
#+END_SRC

For some reason ~(org-agenda-overriding-header)~ is not working on ~agenda~ items...

The weekly review is taken from [[https://orgmode.org/worg/org-tutorials/org-custom-agenda-commands.html][orgmode.org]]

Quick access to GTD view.
#+BEGIN_SRC emacs-lisp
(map! :leader "o g" (lambda ()
             (interactive)
             (org-agenda nil "g")))
#+END_SRC

** appearance

Title size.
#+BEGIN_SRC emacs-lisp
(after! org
  (custom-theme-set-faces
   'user
   `(org-document-title ((t (:height 1.5 :underline nil))))))
#+END_SRC

configure the symbol for stuff hidden after heading.
#+BEGIN_SRC emacs-lisp
(after! org
  (setq org-ellipsis " ..."))
#+END_SRC

