config.org
** opening pdfs

I want pdfs to be opened in an external pdf viewer.

#+BEGIN_SRC emacs-lisp
(after! org
  (add-hook 'org-mode-hook
            '(lambda ()
               (delete '("\\.pdf\\'" . default) org-file-apps)
               (add-to-list 'org-file-apps '("\\.pdf\\'" . "zathura %s")))))
#+END_SRC
** org-noter

Keep plain text notes alongside my pdfs.

#+BEGIN_SRC emacs-lisp
(setq org-noter-always-create-frame nil)
(setq org-noter-notes-search-path org-roam-directory)
#+END_SRC

** org-roam

#+BEGIN_SRC emacs-lisp
(setq org-roam-directory "~/org/roam")
#+END_SRC

I keep my roam files in dropbox folder which causes problems with the database on different machines. Easiest solution is to just keep the database outside the synced folder. The location is chosen arbitrary
#+BEGIN_SRC emacs-lisp
(setq org-roam-db-location "~/.cache/oarg-roam.db")
#+END_SRC


*** deft

I only use ~deft~ for org-roam notes so the config goes here.
#+BEGIN_SRC emacs-lisp
(setq deft-recursive t)
(setq deft-use-filter-string-for-filename t)
(setq deft-default-extension "org")
(setq deft-directory org-roam-directory)
#+END_SRC

Some obscure solution the get a reasonable preview taken from [[https://github.com/jrblevin/deft/issues/75#issuecomment-905031872][this github issue]].

#+BEGIN_SRC emacs-lisp
(defun cm/deft-parse-title (file contents)
  "Parse the given FILE and CONTENTS and determine the title.
  If `deft-use-filename-as-title' is nil, the title is taken to
  be the first non-empty line of the FILE.  Else the base name of the FILE is
  used as title."
  (let ((begin (string-match "^#\\+[tT][iI][tT][lL][eE]: .*$" contents)))
    (if begin
        (string-trim (substring contents begin (match-end 0)) "#\\+[tT][iI][tT][lL][eE]: *" "[\n\t ]+")
      (deft-base-filename file))))

  (advice-add 'deft-parse-title :override #'cm/deft-parse-title)

  (setq deft-strip-summary-regexp
      (concat "\\("
              "[\n\t]" ;; blank
              "\\|^#\\+[[:alpha:]_]+:.*$" ;; org-mode metadata
              "\\|^:properties:\n\\(.+\n\\)+:end:\n"
              "\\|^:PROPERTIES:\n\\(.+\n\\)+:END:\n"
              "\\)"))
#+END_SRC

*** capture templates

Extra properties for org-roam capture.

#+BEGIN_SRC emacs-lisp
(setq org-roam-capture-templates
      '(
        ("b" "bibliography reference" plain "%?"
         :target
         (file+head "${citekey}.org"
                    ":properties:
:author: ${author-or-editor}
:#+created: %(org-insert-time-stamp (current-time) t t)
:#+last_modified: %(org-insert-time-stamp (current-time) t t)
:end:
#+title: ${title}\n
")
         :unnarrowed t)

        ("d" "default" plain "%?"
         :target
         (file+head "%<%Y%m%d%H%M%S>-${slug}.org"
                    ":properties:
:#+created: %(org-insert-time-stamp (current-time) t t)
:#+last_modified: %(org-insert-time-stamp (current-time) t t)
:end:
#+title: ${title}
")
         :unnarrowed t)))
#+END_SRC

*** timestamps

Make available ‘#+last_modified’, an automatically updated timestamp, for org files. This src block can probably be moved at some point to the general org-config, but currently I only use the timestamp feature for ~ORB~.

#+BEGIN_SRC emacs-lisp
(after! org
  (setq time-stamp-active t
        time-stamp-line-limit 10
        time-stamp-start "#\\+last_modified: [\t]*"
        time-stamp-end "$"
        time-stamp-format "\[%Y-%02m-%02d %02H:%02M\]"
        )
  (add-hook 'write-file-hooks 'time-stamp)
  )
#+END_SRC
*** org-roam-bibtex

Combines ~org-roam~, with ~(helm/ivy)-bibtex~ and ~org-ref~.

Only for activating org-roam bibtex.
#+BEGIN_SRC emacs-lisp
(use-package! org-roam-bibtex
  :after org-roam
  :config
  (require 'org-ref)) ; optional: if Org Ref is not loaded anywhere else, load it here

(after! org-roam
  (org-roam-bibtex-mode))
#+END_SRC


Currently I only need one template, but I want more properties.

#+BEGIN_SRC emacs-lisp
(setq orb-preformat-keywords
      '("citekey" "title" "url" "author-or-editor" "keywords" "file")
      orb-process-file-keyword t
      orb-file-field-extensions '("pdf"))

;; (setq orb-templates
;;       '(("r" "ref" plain "%?"
;;          :target
;;          (file+head "${citekey}.org" "#+title: ${title}\n"))))
;; #+roam_key: ${ref}
;; #+author: ${author-or-editor}
;; #+created: %(org-insert-time-stamp (current-time) t t)
;; #+last_modified: %(org-insert-time-stamp (current-time) t t)

;; - tags ::
;; - keywords :: ${keywords}

;; \n* ${title}
;; :properties:
;; :citekey: ${citekey}
;; :author: ${author-or-editor}
;; :noter_document: ${file}
;; :end:"))))

#+END_SRC

The later part provide integration with org-noter, see [[https://github.com/org-roam/org-roam-bibtex/blob/8d80bf980776df6ead53e917eb482ec8e309a1d7/doc/orb-manual.org][orb github]].


** org-timer

First we need to "unmap" leader o t which by default is `+vterm/toggle`.

#+BEGIN_SRC emacs-lisp
(map! :leader "o t" nil)

(map! :leader
      :desc "open terminal here" "o t h" #'+vterm/toggle
      :desc "set timer" "o t s" #'org-timer-set-timer
      :desc "pause or continue" "o t p" #'org-timer-pause-or-continue)
#+END_SRC


* LaTeX
** general

#+BEGIN_SRC emacs-lisp
(after! latex
  (setq tex-fontify-script t
        ;; automatically put braces after ^ and _
        TeX-electric-sub-and-superscript nil
        ;; stop asking if I want to save
        TeX-save-query nil
        ;; auto insert second dollar sign
        ;; TeX-electric-math (cons "$" "$")
        ;; don't show ^ or _ for scripts
        font-latex-fontify-script t)

  ;; use Zathura as pdf viewer
  (setq TeX-view-program-selection '((output-pdf "Zathura"))
        TeX-source-correlate-start-server t))

;; Ensure that synctex works and the pdf is updated.
(after! latex
  (add-hook! 'TeX-after-compilation-finished-functions #'TeX-revert-document-buffer))

#+END_SRC

Do not spellcheck latex documents when opened, this takes a lot of time.
#+BEGIN_SRC emacs-lisp
(after! tex
  (setq-hook! 'TeX-mode-hook +flyspell-immediately nil))
#+END_SRC

experimental
#+BEGIN_SRC emacs-lisp
(defun ab/run-latexmk ()
  "Run LatexMk without asking for confirmation. Saves the master file (and children)."
  (interactive)
  (TeX-save-document (TeX-master-file))
  (TeX-command "LatexMk" #'TeX-master-file -1))
#+END_SRC

** keybindings

LaTeX specific keybindings.

#+BEGIN_SRC emacs-lisp
(map! :map LaTeX-mode-map
      :localleader
      :desc "Compile"     ","  #'TeX-command-run-all
      :desc "Fold"        "z"  #'TeX-fold-buffer
      :desc "ToC"         "t"  #'reftex-toc
      :desc "next err"    "n"  #'TeX-next-error
      :desc "View"        "v"  #'TeX-view
      :desc "count words" "c"  #'tex-count-words
)
#+END_SRC
** company

Enable company-bibtex for completion.

#+BEGIN_SRC emacs-lisp
(add-to-list 'company-backends 'company-bibtex)
(setq company-bibtex-bibliography
  '("~/academia/bibliography/bibfile.bib"))
#+END_SRC

** matchit

add some LaTeX keywords which are not included by ~evil-matchit~ by default.

#+BEGIN_SRC emacs-lisp
(eval-after-load 'evil-matchit-latex
  '(progn
     (push '("langle" nil "rangle") evilmi-latex-match-tags)))
     ;; (push '(("unless" "if") ("elsif" "else") "end"))) evilmi-latex-match-tags)
#+END_SRC

** ~evil-tex~

This package introduces new text objects e.g. ~ci$~ now changes inside $...$.
Always use it when editing tex files:

#+BEGIN_SRC emacs-lisp
(add-hook 'TeX-mode-hook (lambda () (interactive) (evil-tex-mode 1)))

#+END_SRC

evil-tex has very nice toggle commands but I can't remember them.

#+BEGIN_SRC emacs-lisp
(map! :map LaTeX-mode-map
      :localleader :desc "toggle delimiter" "d"  #'evil-tex-toggle-delim)

(after! evil-tex
  ;; `ts` starts Toggle Surround
  (setq evil-tex-toggle-override-t t))
#+END_SRC
** XeTeX

Add Xetex support (not working..)

#+BEGIN_SRC emacs-lisp
;; (after! latex
;;     (add-to-list TeX-command-list '("XeLaTeX" "%`xelatex%(mode)%' %t" TeX-run-TeX nil t)))
#+END_SRC


* bibtex completion

** config

~bibtex-completion~ configuration through the package itself (should work in vanilla emacs).

#+BEGIN_SRC emacs-lisp
(map! :leader "b t" 'ivy-bibtex)
(map! :leader "b a" 'arxiv-lookup)

(after! bibtex-completion

  (setq! bibtex-completion-bibliography '("~/academia/bibliography/bibfile.bib")
         bibtex-completion-notes-path org-roam-directory
         bibtex-completion-library-path '("~/ucloud/my_stuff/papers" )))
#+END_SRC

You may store additional PDFs for a given entry, such as an annotated version of the original PDF, a file containing supplemental material, or chapter files.
All files whose name start with the BibTeX key will then be associated with an entry.
Note that for performance reasons, these additional files are only detected when triggering an action, such as “Open PDF file”. When the whole bibliography is loaded, only the “main” PDF bibtex-key.pdf is detected.

#+BEGIN_SRC emacs-lisp
(after! bibtex-completion
  (setq! bibtex-completion-find-additional-pdfs t))
#+END_SRC


Doom provides a way to configure ~bibtex-completion~ and ~org-ref~ at the same time through:

#+BEGIN_SRC emacs-lisp
(setq! +biblio-pdf-library-dir "~/ucloud/my_stuff/papers"
       +biblio-default-bibliography-files '("~/academia/bibliography/bibfile.bib")
       +biblio-notes-path org-roam-directory)
#+END_SRC

Use additional tags to find papers.

#+BEGIN_SRC emacs-lisp
(after! bibtex-completion
  (setq bibtex-completion-additional-search-fields '(tags)))
#+END_SRC

