config.el
               (delete '("\\.pdf\\'" . default) org-file-apps)
               (add-to-list 'org-file-apps '("\\.pdf\\'" . "zathura %s")))))

(setq org-noter-always-create-frame nil)
(setq org-noter-notes-search-path org-roam-directory)

(setq org-roam-directory "~/org/roam")

(setq org-roam-db-location "~/.cache/oarg-roam.db")

(setq deft-recursive t)
(setq deft-use-filter-string-for-filename t)
(setq deft-default-extension "org")
(setq deft-directory org-roam-directory)

(defun cm/deft-parse-title (file contents)
  "Parse the given FILE and CONTENTS and determine the title.
  If `deft-use-filename-as-title' is nil, the title is taken to
  be the first non-empty line of the FILE.  Else the base name of the FILE is
  used as title."
  (let ((begin (string-match "^#\\+[tT][iI][tT][lL][eE]: .*$" contents)))
    (if begin
        (string-trim (substring contents begin (match-end 0)) "#\\+[tT][iI][tT][lL][eE]: *" "[\n\t ]+")
      (deft-base-filename file))))

  (advice-add 'deft-parse-title :override #'cm/deft-parse-title)

  (setq deft-strip-summary-regexp
      (concat "\\("
              "[\n\t]" ;; blank
              "\\|^#\\+[[:alpha:]_]+:.*$" ;; org-mode metadata
              "\\|^:PROPERTIES:\n\\(.+\n\\)+:END:\n"
              "\\)"))

(setq org-roam-capture-templates
      '(
        ("b" "bibliography reference" plain "%?"
         :target
         (file+head "${citekey}.org" "#+title: ${title}\n
#+created: %(org-insert-time-stamp (current-time) t t)
#+last_modified: %(org-insert-time-stamp (current-time) t t)




\n* ${title}
:PROPERTIES:
:citekey: ${citekey}
:author: ${author-or-editor}
:noter_document: ${file}
:END:")
         :unnarrowed t)

        ("d" "default" plain "%?"
         :target
         (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}
#+created: %(org-insert-time-stamp (current-time) t t)
#+last_modified: %(org-insert-time-stamp (current-time) t t)
")
         :unnarrowed t)))

(after! org
  (setq time-stamp-active t
        time-stamp-line-limit 10
        time-stamp-start "#\\+last_modified: [\t]*"
        time-stamp-end "$"
        time-stamp-format "\[%Y-%02m-%02d %02H:%02M\]"
        )
  (add-hook 'write-file-hooks 'time-stamp)
  )

(use-package! org-roam-bibtex
  :after org-roam
  :config
  (require 'org-ref)) ; optional: if Org Ref is not loaded anywhere else, load it here

(after! org-roam
  (org-roam-bibtex-mode))

(setq orb-preformat-keywords
      '("citekey" "title" "url" "author-or-editor" "keywords" "file")
      orb-process-file-keyword t
      orb-file-field-extensions '("pdf"))

;; (setq orb-templates
;;       '(("r" "ref" plain "%?"
;;          :target
;;          (file+head "${citekey}.org" "#+title: ${title}\n"))))
;; #+roam_key: ${ref}
;; #+author: ${author-or-editor}
;; #+created: %(org-insert-time-stamp (current-time) t t)
;; #+last_modified: %(org-insert-time-stamp (current-time) t t)

;; - tags ::
;; - keywords :: ${keywords}

;; \n* ${title}
;; :propertIES:
;; :citekey: ${citekey}
;; :author: ${author-or-editor}
;; :noter_document: ${file}
;; :end:"))))

(map! :leader "o t" nil)

(map! :leader
      :desc "open terminal here" "o t h" #'+vterm/toggle
      :desc "set timer" "o t s" #'org-timer-set-timer
      :desc "pause or continue" "o t p" #'org-timer-pause-or-continue)

(after! latex
  (setq tex-fontify-script t
        ;; automatically put braces after ^ and _
        TeX-electric-sub-and-superscript nil
        ;; stop asking if I want to save
        TeX-save-query nil
        ;; auto insert second dollar sign
        ;; TeX-electric-math (cons "$" "$")
        ;; don't show ^ or _ for scripts
        font-latex-fontify-script t)

  ;; use Zathura as pdf viewer
  (setq TeX-view-program-selection '((output-pdf "Zathura"))
        TeX-source-correlate-start-server t))

;; Ensure that synctex works and the pdf is updated.
(after! latex
  (add-hook! 'TeX-after-compilation-finished-functions #'TeX-revert-document-buffer))

(after! tex
  (setq-hook! 'TeX-mode-hook +flyspell-immediately nil))

(defun ab/run-latexmk ()
  "Run LatexMk without asking for confirmation. Saves the master file (and children)."
  (interactive)
  (TeX-save-document (TeX-master-file))
  (TeX-command "LatexMk" #'TeX-master-file -1))

(map! :map LaTeX-mode-map
      :localleader
      :desc "Compile"     ","  #'TeX-command-run-all
      :desc "Fold"        "z"  #'TeX-fold-buffer
      :desc "ToC"         "t"  #'reftex-toc
      :desc "next err"    "n"  #'TeX-next-error
      :desc "View"        "v"  #'TeX-view
      :desc "count words" "c"  #'tex-count-words
)

(add-to-list 'company-backends 'company-bibtex)
(setq company-bibtex-bibliography
  '("~/academia/bibliography/bibfile.bib"))

(eval-after-load 'evil-matchit-latex
  '(progn
     (push '("langle" nil "rangle") evilmi-latex-match-tags)))
     ;; (push '(("unless" "if") ("elsif" "else") "end"))) evilmi-latex-match-tags)

(add-hook 'TeX-mode-hook (lambda () (interactive) (evil-tex-mode 1)))

(map! :map LaTeX-mode-map
      :localleader :desc "toggle delimiter" "d"  #'evil-tex-toggle-delim)

(after! evil-tex
  ;; `ts` starts Toggle Surround
  (setq evil-tex-toggle-override-t t))

(map! :leader "b t" 'ivy-bibtex)
(map! :leader "b a" 'biblio-arxiv-lookup)

(after! bibtex-completion

  (setq! bibtex-completion-bibliography '("~/academia/bibliography/bibfile.bib")
         bibtex-completion-notes-path org-roam-directory
         bibtex-completion-library-path '("~/ucloud/my_stuff/papers" )))

(after! bibtex-completion
  (setq! bibtex-completion-find-additional-pdfs t))

(setq! +biblio-pdf-library-dir "~/ucloud/my_stuff/papers"
       +biblio-default-bibliography-files '("~/academia/bibliography/bibfile.bib")
       +biblio-notes-path org-roam-directory)

(after! bibtex-completion
  (setq bibtex-completion-additional-search-fields '(tags)))
