config.org
** ivy-bibtex

how to set ivy-height as a function [[https://github.com/abo-abo/swiper/issues/1722][github issue.]]

#+BEGIN_SRC emacs-lisp
(after! ivy-bibtex

  (setq ivy-height 30) ;; this is actually a general ivy configuration

  (defun bibtex-completion-pdf-open-with-zathura (entry)
    (let ((pdf (bibtex-completion-find-pdf entry)))
      (call-process "zathura" nil 0 nil (car pdf)))
      (kill-buffer "*doom*"))

  (defun bibtex-completion-pdf-open-with-evince (entry)
    (let ((pdf (bibtex-completion-find-pdf entry)))
      (call-process "evince" nil 0 nil (car pdf)))
      (+workspace/close-window-or-workspace)
      ;; (kill-buffer "*doom*")
      )

  ;; (ivy-add-actions 'ivy-bibtex '(("o" ivy-bibtex-open-any "Open PDF, URL, or DOI")))

  ;; (setq ivy-bibtex-default-action 'ivy-bibtex-insert-key)

;; the default action list is too long and there is no (obvious) way to remove entries so I start from scratch
(ivy-set-actions
 'ivy-bibtex
 '(("o" ivy-bibtex-open-any "Open PDF, URL, or DOI")
   ("i" ivy-bibtex-insert-key "Insert key")
   ;; ("a" ivy-bibtex-add-PDF-attachment "Attach PDF to email") ;; email not yet working
   ("s" ivy-bibtex-show-entry "Show entry")
   ("z" bibtex-completion-pdf-open-with-zathura "Open PDF in zathura")
   ("E" bibtex-completion-pdf-open-with-evince "Open PDF in Evince")
   ;; ("c" ivy-bibtex-insert-link-to-file "Insert link to file") ;; this could make org-ref obsolete
   ("e" ivy-bibtex-edit-notes "Edit notes"))))
#+END_SRC

** helm-bibtex

TODO: add "open in zathura"
#+BEGIN_SRC emacs-lisp
;; (helm-add-action-to-source "Open PDF with zathura" 'bibtex-completion-pdf-open-with-zathura helm-source-bibtex 1)
#+END_SRC

** org-ref

Conveniently insert citations in org files. These citations can be used to open the corresponding pdf or notes.
It would probably be more sensible to simply define a (helm/ivy)-bibtex command that inserts the link to the pdf instead if including a new package but ok..

#+BEGIN_SRC emacs-lisp
(after! org-ref
  (map! :localleader "i" nil)
  (map! :map org-mode-map
        :localleader
        :desc "insert citation" "i" #'org-ref-cite-insert-helm))
(after! org
  (map! :localleader "i" nil)
  (map! :map org-mode-map
        :localleader
        :desc "insert citation" "i" #'org-ref-cite-insert-helm))

(setq reftex-default-bibliography '("~/academia/bibliography/bibfile.bib"))
#+END_SRC

This opens a full screen helm buffer. Partial screen would be nicer! Is there an ivy option for this?

* snippets

Snippets are everything!

~yas-keymap~: "The active keymap while a snippet expansion is in progress."

#+BEGIN_SRC emacs-lisp
(after! yasnippet
  (setq yas-snippet-dirs '("~/.doom.d/snippets")
        yas-triggers-in-field t)
  ;; remove random additional newline at the end of new snippets
  (setq-default mode-require-final-newline nil)
  (map! :map yas-minor-mode-map
        :i "C-e" 'yas-expand
        :i "C-f" 'yas-next-field) ;; sometimes I don't want to expand and just go to the next field
  (map! :map yas-keymap "C-e" 'yas-next-field-or-maybe-expand))
#+END_SRC

For some reason ~yas-new-snippet~ cannot guess where to put the snippet (can't guess the mode).
Therefore I'm using ~yas/new-snippet~, although it's obsolete since yasnippet 0.8.
Note that Doom overwrites ~yas-new-snippet~ with ~+snippet/new~. Maybe this is where the problem happens.

#+BEGIN_SRC emacs-lisp
(after! yasnippet
  (map! :leader "s n" 'yas/new-snippet              ;; Snippet New
        ;; :leader "s f" '+snippet/find                ;; Snippet Go
        :leader "s g" 'yas-visit-snippet-file))      ;; Snippet Go
#+END_SRC


** auto expanding

For selected snippets I want them to be automatically expanded (without pressing a trigger key), similarly to what ~abbrev~ already offers (or ~iabbrev~ in vim). However, ~abbrev~ has a super weird syntax.

This code adds this functionality by adding ~#condition: 'auto~ to the header of the snippet.
Code is taken from [[https://github.com/joaotavora/yasnippet/issues/998][a github issue]].

#+BEGIN_SRC emacs-lisp
(defun ab/yas-try-expanding-auto-snippets ()
  (let ((yas-buffer-local-condition ''(require-snippet-condition . auto)))
    (yas-expand)))
(add-hook 'post-command-hook #'ab/yas-try-expanding-auto-snippets)
#+END_SRC
** allow snippets to modify buffer
I added some snippets which modify the buffer by deleting spaces before the snippet. This causes yasnippet to issue warnings.
Remove those warnings:
#+BEGIN_SRC emacs-lisp
(after! warnings
  (add-to-list 'warning-suppress-types '(yasnippet backquote-change)))
#+END_SRC

* syntax checking

#+BEGIN_SRC emacs-lisp
(after! flycheck
;;(flycheck-display-errors-delay .3)
;;(setq-default flycheck-disabled-checkers '(tex-chktex)))
  (map! :leader "a" 'flycheck-next-error))
#+END_SRC

There is a bug in ~chk-tex~, see [[https://github.com/flycheck/flycheck/issues/1214][issue]]. They also describe possible workarounds.

Fixing would be nice too, but apparently this is open, cf. [[https://github.com/flycheck/flycheck/issues/530][issue]].

* python
** config
#+BEGIN_SRC emacs-lisp
(after! python
  (map! :map python-mode-map
        :localleader "r r" 'run-python
                     "s s" 'python-shell-switch-to-shell
                     "s r" 'python-shell-send-region
                     "r s" 'pyvenv-restart-python
                     ","   'python-shell-send-buffer     ; replace C-c C-c
                     "c a" 'conda-env-activate
        ))
#+END_SRC

When making changes in other buffers (not the one I'm sending) they are not registered. So I keep having to restart the python process. So I decided to put this in the run function

#+BEGIN_SRC emacs-lisp
(defun python-shell-start-and-send-buffer()
  (interactive)
  (run-python)
  (evil-window-left)
  (python-shell-send-buffer))

(defun ab/restart-and-run-python()
  "restart and run to make sure all changes are registered when running code"

  (interactive)
  ;; (pyvenv-restart-python)
  (kill-process "Python")
  (sleep-for 0.05)
  (kill-buffer "*Python*")
  (previous-window-any-frame)
  (run-python))
#+END_SRC


** fixes
Supposed to fix the
~Warning (python): Your ‘python-shell-interpreter’ doesn’t seem to support readline, yet ‘python-shell-completion-native-enable’ was t and "python3" is not part of the ‘python-shell-completion-native-disabled-interpreters’ list.  Native completions have been disabled locally.~
Warning.
#+BEGIN_SRC emacs-lisp
(after! python
  (setq python-shell-completion-native-enable nil))
#+END_SRC
** conda

I automatically want the right conda environment activated when editing a python file.
How does emacs know which one is the right environment? I don't know..
#+BEGIN_SRC emacs-lisp
(after! conda
  (conda-env-initialize-eshell)
  (conda-env-autoactivate-mode))
#+END_SRC
** linting

Flycheck supports multiple checkers at once put only in a sequential fashion, see [[https://www.flycheck.org/en/latest/user/syntax-checkers.html#flycheck-checker-chains][flyckeck.org]]

This is the correct solution for doom emacs according to [[https://github.com/hlissner/doom-emacs/issues/1530][github]].


#+BEGIN_SRC emacs-lisp
;; (defun my-flycheck-setup ()
;;   (flycheck-add-next-checker 'lsp 'python-flake8))

;; ;; These MODE-local-vars-hook hooks are a Doom thing. They're executed after
;; ;; MODE-hook, on hack-local-variables-hook. Although `lsp!` is attached to
;; ;; python-mode-local-vars-hook, it should occur earlier than my-flycheck-setup
;; ;; this way:
;; (add-hook 'python-mode-local-vars-hook #'my-flycheck-setup)
#+END_SRC

A general emacs solution was suggested on [[https://www.reddit.com/r/emacs/comments/gqymvz/how_to_force_flycheck_to_select_a_specific_syntax/][reddit]] but doesn't work for doom.
** unicode
As julia, python allows for unicode characters but somehow entering them it is
not as easy as in julia (where it is sufficient to time the texcode and "TAB").

#+BEGIN_SRC emacs-lisp
(setq default-input-method "TeX")
#+END_SRC

* julia


shift-enter would also be nice for send line

#+BEGIN_SRC emacs-lisp
(map! :map julia-mode-map
    :localleader "r r"  'julia-repl
                 ","    'julia-repl-send-buffer
                 "l"    'julia-repl-send-line
                 "r l"  'julia-repl-send-line
    )
#+END_SRC

use nice terminal instead of the default ansi
#+BEGIN_SRC emacs-lisp
(after! julia-repl
  (julia-repl-set-terminal-backend 'vterm))
#+END_SRC

Define a minor mode to enable sending to julia-repl (taken from [[https://www.tquelch.com/posts/emacs-config/][here]]).
#+BEGIN_SRC emacs-lisp
(define-minor-mode julia-repl-interaction-mode
  "Toggle keybinds to send lines to the julia-repl"
  :keymap (let ((map (make-sparse-keymap)))
          (define-key map (kbd "C-s") #'julia-repl-send-region-or-line)
          map))
#+END_SRC


This fix is necessary for lsp to work in julia:
#+BEGIN_SRC emacs-lisp
(after! julia-mode
  (add-hook 'julia-mode-hook #'rainbow-delimiters-mode-enable)
  (add-hook! 'julia-mode-hook
    (setq-local lsp-enable-folding t
                lsp-folding-range-limit 100)))
#+END_SRC


* auto completion
