config.org
** Navigation

Navigate pdfs the way I'm used to.

#+BEGIN_SRC emacs-lisp
(after! pdf-tools

  ;; more fine-grained zooming
  (setq! pdf-view-resize-factor 1.1)

  ;; (map! image-mode-map
  ;;  :m "i"   'image-forward-hscroll)

  (map!
   :map pdf-view-mode-map
   :m "n"   'evil-collection-pdf-view-next-line-or-next-page
   :m "e"   'evil-collection-pdf-view-previous-line-or-previous-page
   :m "i"   'image-forward-hscroll
   ;; :m "gg"  'pdf-view-first-page
   ;; :m "G"   'pdf-view-last-page
   ;; :m "h"   'pdf-view-con
   :m "C-o" 'pdf-view-shrink
   :m "C-i" 'pdf-view-enlarge
   :m "C-u" 'pdf-view-scroll-down-or-previous-page
   :m "C-d" 'pdf-view-scroll-up-or-next-page))

#+END_SRC

** UI

Start in dark mode.

#+BEGIN_SRC emacs-lisp
(after! pdf-tools
  (add-hook! 'pdf-tools-enabled-hook 'pdf-view-midnight-minor-mode))
#+END_SRC

automatically annotate highlights.

#+BEGIN_SRC emacs-lisp
(setq pdf-annot-activate-created-annotations t)

(after! pdf-tools
  (map! :map pdf-view-mode-map
    :m "h" 'pdf-annot-add-highlight-markup-annotation)

  ;; automatically annotate highlights
  ;; (setq pdf-annot-activate-created-annotations t)
  )
#+END_SRC
* rss

#+BEGIN_SRC emacs-lisp
(map! :leader "e f" #'elfeed)
#+END_SRC

** set feeds

#+BEGIN_SRC emacs-lisp
(setq! elfeed-feeds
      '(("http://export.arxiv.org/api/query?search_query=cat:math.OC&start=0&max_results=300&sortBy=submittedDate&sortOrder=descending" research)
        ("http://www.argmin.net/feed.xml" blog)))
#+END_SRC


#+BEGIN_SRC emacs-lisp
(after! elfeed
  (setq elfeed-search-filter "@1-month-ago"))
#+END_SRC



rename the feeds
#+BEGIN_SRC emacs-lisp
(defadvice elfeed-search-update (before nullprogram activate)
  (let ((feed (elfeed-db-get-feed "http://export.arxiv.org/api/query?search_query=cat:math.OC&start=0&max_results=300&sortBy=submittedDate&sortOrder=descending")))
    (setf (elfeed-feed-title feed) "arXiv optimization")))
#+END_SRC

** keybindings

By default q only closes the buffer but leaves the window open....
#+BEGIN_SRC emacs-lisp
;; (map! :map elfeed-show-mode-map
;;       :n "q" #'elfeed-search-quit-window)

(after! elfeed
  (map! :map elfeed-show-mode-map
        :n "q" #'elfeed-search-quit-window))
#+END_SRC


not yet working
#+BEGIN_SRC emacs-lisp

(after! elfeed
  (map! :map elfeed-search-mode-map
        :n "i" #'elfeed-search-show-entry))

(map! :map elfeed-show-mode-map
      :after elfeed-show
      :n "h" #'elfeed-search-quit-window
      :n "N" #'elfeed-show-next
      :n "E" #'elfeed-show-prev
      :n "y" #'elfeed-show-yank)

#+END_SRC

#+BEGIN_SRC emacs-lisp
;; (defun elfeed-search-show-entry-pre (&optional lines)
;;   "Returns a function to scroll forward or back in the Elfeed
;;   search results, displaying entries without switching to them."
;;       (lambda (times)
;;         (interactive "p")
;;         (forward-line (* times (or lines 0)))
;;         (recenter)
;;         (call-interactively #'elfeed-search-show-entry)
;;         (select-window (previous-window))
;;         (unless elfeed-search-remain-on-entry (forward-line -1))))

;; (after! elfeed
;;   (define-key elfeed-search-mode-map (kbd "N") (elfeed-search-show-entry-pre +1))
;;   (define-key elfeed-search-mode-map (kbd "E") (elfeed-search-show-entry-pre -1)))
#+END_SRC

** attempt

# #+BEGIN_SRC emacs-lisp
# (defvar elfeed-show-mode-map
#   (let ((map (make-sparse-keymap)))
#     (prog1 map
#       (suppress-keymap map)
#       (define-key map "d" 'elfeed-show-save-enclosure)
#       (define-key map "q" 'elfeed-kill-buffer)
#       (define-key map "g" 'elfeed-show-refresh)
#       (define-key map "n" 'elfeed-show-next)
#       (define-key map "N" 'elfeed-show-next)
#       (define-key map "p" 'elfeed-show-prev)
#       (define-key map "s" 'elfeed-show-new-live-search)
#       (define-key map "b" 'elfeed-show-visit)
#       (define-key map "y" 'elfeed-show-yank)
#       (define-key map "A" 'elfeed-show-add-enclosure-to-playlist)
#       (define-key map "P" 'elfeed-show-play-enclosure)))
#   "Keymap for `elfeed-show-mode'.")
# #+END_SRC
** tecosaur

#+BEGIN_SRC emacs-lisp
;; (map! :map elfeed-search-mode-map
;;       :after elfeed-search
;;       [remap kill-this-buffer] "q"
;;       [remap kill-buffer] "q"
;;       :n doom-leader-key nil
;;       :n "q" #'+rss/quit
;;       :n "e" #'elfeed-update
;;       :n "r" #'elfeed-search-untag-all-unread
;;       :n "u" #'elfeed-search-tag-all-unread
;;       :n "s" #'elfeed-search-live-filter
;;       :n "RET" #'elfeed-search-show-entry
;;       :n "p" #'elfeed-show-pdf
;;       :n "+" #'elfeed-search-tag-all
;;       :n "-" #'elfeed-search-untag-all
;;       :n "S" #'elfeed-search-set-filter
;;       :n "b" #'elfeed-search-browse-url
;;       :n "y" #'elfeed-search-yank)
;; (after! evil

;; (map! :map elfeed-show-mode-map
;;       :after elfeed-show
;;       [remap kill-this-buffer] "q"
;;       [remap kill-buffer] "q"
;;       :n doom-leader-key nil
;;       :nm "q" #'+rss/delete-pane
;;       :nm "o" #'ace-link-elfeed
;;       :nm "RET" #'org-ref-elfeed-add
;;       :nm "N" #'elfeed-show-next
;;       :nm "E" #'elfeed-show-prev
;;       :nm "p" #'elfeed-show-pdf
;;       :nm "+" #'elfeed-show-tag
;;       :nm "-" #'elfeed-show-untag
;;       :nm "s" #'elfeed-show-new-live-search
;;       :nm "y" #'elfeed-show-yank))

;; (after! elfeed-search
;;   (set-evil-initial-state! 'elfeed-search-mode 'normal))
;; (after! elfeed-show-mode
;;   (set-evil-initial-state! 'elfeed-show-mode   'normal))

;; (after! evil-snipe
;;   (push 'elfeed-show-mode   evil-snipe-disabled-modes)
;;   (push 'elfeed-search-mode evil-snipe-disabled-modes))
#+END_SRC


** misc

load new feeds when opened
#+BEGIN_SRC emacs-lisp
(add-hook! 'elfeed-search-mode-hook 'elfeed-update)
#+END_SRC

A helper function that gets the authors names.
#+BEGIN_SRC emacs-lisp
(defun concatenate-authors (authors-list)
  "Given AUTHORS-LIST, list of plists; return string of all authors concatenated."
  (if (> (length authors-list) 1)
      (format "%s et al." (plist-get (nth 0 authors-list) :name))
    (plist-get (nth 0 authors-list) :name)))
#+END_SRC

date and width
#+BEGIN_SRC emacs-lisp
;; (setq! elfeed-search-date-format '("%y-%m-%d" 10 :left))
;; (setq! elfeed-search-title-max-width 110)
#+END_SRC

Customize how the opened entries look (show things like title, author,...)
#+BEGIN_SRC emacs-lisp
(defun my-search-print-fn (entry)
  "Print ENTRY to the buffer."
  (let* ((date (elfeed-search-format-date (elfeed-entry-date entry)))
         (title (or (elfeed-meta entry :title)
                    (elfeed-entry-title entry) ""))
         (title-faces (elfeed-search--faces (elfeed-entry-tags entry)))
         (entry-authors (concatenate-authors
                         (elfeed-meta entry :authors)))
         (title-width (- (window-width) 10
                         elfeed-search-trailing-width))
         (title-column (elfeed-format-column
                        title 100
                        :left))
         ;; (entry-score (elfeed-format-column (number-to-string (elfeed-score-scoring-get-score-from-entry entry)) 10 :left))
         (authors-column (elfeed-format-column entry-authors 40 :left)))
    (insert (propertize date 'face 'elfeed-search-date-face) " ")

    (insert (propertize title-column
                        'face title-faces 'kbd-help title) " ")
    (insert (propertize authors-column
                        'kbd-help entry-authors) " ")
    ;; (insert entry-score " ")
    ))

(setq! elfeed-search-print-entry-function #'my-search-print-fn)
;; (after! elfeed
;;   (setq! elfeed-search-print-entry-function #'my-search-print-fn))
#+END_SRC

#+BEGIN_SRC emacs-lisp
;; (defun robo/elfeed-entry-to-arxiv ()
;;   "Fetch an arXiv paper into the local library from the current elfeed entry."
;;   (interactive)
;;   (let* ((link (elfeed-entry-link elfeed-show-entry))
;;          (match-idx (string-match "arxiv.org/abs/\\([0-9.]*\\)" link))
;;          (matched-arxiv-number (match-string 1 link)))
;;     (when matched-arxiv-number
;;       (message "Going to arXiv: %s" matched-arxiv-number)
;;       (arxiv-get-pdf-add-bibtex-entry matched-arxiv-number +biblio-default-bibliography-files +biblio-pdf-library-dir))))

;; (map! (:after elfeed
;;        (:map elfeed-search-mode-map
;;         :desc "Open entry" "m" #'elfeed-search-show-entry)
;;        (:map elfeed-show-mode-map
;;         :desc "Fetch arXiv paper to the local library" "a" #'robo/elfeed-entry-to-arxiv)))
#+END_SRC

*** a similiar config from a different website

from [[https://cundy.me/post/elfeed/][here:]]

#+BEGIN_SRC emacs-lisp
;; (defun ab/concatenate-authors (authors-list)
;;   "Given AUTHORS-LIST, list of plists; return string of all authors concatenated."
;;   (mapconcat
;;    (lambda (author) (plist-get author :name))
;;    authors-list ", "))
#+END_SRC


#+BEGIN_SRC emacs-lisp
;; (defun my-search-print-fn (entry)
;;   "Print ENTRY to the buffer."
;;   (let* ((date (elfeed-search-format-date (elfeed-entry-date entry)))
;; 	 (title (or (elfeed-meta entry :title)
;; 		    (elfeed-entry-title entry) ""))
;; 	 (title-faces (elfeed-search--faces (elfeed-entry-tags entry)))
;; 	 (feed (elfeed-entry-feed entry))
;; 	 (feed-title
;; 	  (when feed
;; 	    (or (elfeed-meta feed :title) (elfeed-feed-title feed))))
;; 	 (entry-authors (ab/concatenate-authors
;; 			 (elfeed-meta entry :authors)))
;; 	 (tags (mapcar #'symbol-name (elfeed-entry-tags entry)))
;; 	 (tags-str (mapconcat
;; 		    (lambda (s) (propertize s 'face
;; 					    'elfeed-search-tag-face))
;; 		    tags ","))
;; 	 (title-width (- (window-width) 10
;; 			 elfeed-search-trailing-width))
;; 	 (title-column (elfeed-format-column
;; 			title (elfeed-clamp
;; 			       elfeed-search-title-min-width
;; 			       title-width
;; 			       elfeed-search-title-max-width)
;; 			:left))
;; 	 (authors-width 135)
;; 	 (authors-column (elfeed-format-column
;; 			entry-authors (elfeed-clamp
;; 			       elfeed-search-title-min-width
;; 			       authors-width
;; 			       131)
;; 			:left)))

;;     (insert (propertize date 'face 'elfeed-search-date-face) " ")

;;     (insert (propertize title-column
;; 			'face title-faces 'kbd-help title) " ")

;;     (insert (propertize authors-column
;; 			'face 'elfeed-search-date-face
;; 			'kbd-help entry-authors) " ")

;;     ;; (when feed-title
;;     ;;   (insert (propertize entry-authors
;;     ;; 'face 'elfeed-search-feed-face) " "))

;;     (when entry-authors
;;       (insert (propertize feed-title
;; 			  'face 'elfeed-search-feed-face) " "))

;;     ;; (when tags
;;     ;;   (insert "(" tags-str ")"))

;;     )
;;   )
;; (setq elfeed-search-print-entry-function #'my-search-print-fn)
#+END_SRC

** scoring
scoring based on keywords
#+BEGIN_SRC emacs-lisp
;; (elfeed-score-load-score-file "~/.doom.d/elfeed.score") ; See the elfeed-score documentation for the score file syntax
;; (setq! elfeed-score-serde-score-file "~/.doom.d/elfeed.serde.score")
;; (elfeed-score-enable)
;; (define-key elfeed-search-mode-map "=" elfeed-score-map)
#+END_SRC




* ~avy~

** keys being used :colemak:

~avy~ uses the qwerty home row by default. Change this.

#+BEGIN_SRC emacs-lisp
(setq avy-keys '(?a ?r ?s ?t ?d ?h ?n ?e ?i ?o))
#+END_SRC

